[
  {
    "title": "Document Management System for the Federal Office of Migration",
    "client": {
      "name": "Unisys Switzerland",
      "link": "http://www.unisys.ch/index.htm"
    },
    "period": "2012-2014",
    "description": "Technologies: Java, Spring, Hibernate, JPA, JSF, Primefaces, Oracle, Tomcat, CI (Maven, Hudson, Sonar, Nexus, Team Foundation Server) "
  },
  {
    "title": "Digital Archive of the Swiss National Library (e-Helvetica)",
    "client": {
      "name": "Unisys Switzerland",
      "link": "http://www.unisys.ch/index.htm"
    },
    "period": "2011-2012",
    "description": "Technologies: Java, Spring, Hibernate, JSF, ICEFaces, Luscene, Solr, Oracle Weblogic"
  },
  {
    "title": "Application for Environmental Budgeting, Federal Office for the Environment",
    "client": {
      "name": "Unisys Switzerland",
      "link": "http://www.unisys.ch/index.htm"
    },
    "period": "2011",
    "description": "Technologies: C#, .NET, MS SQL Server, Entity Framework, Ext.NET, ASP.NET, WPF, Team Foundation Server "
  },
  {
    "title": "Inventory Solution for the Swiss Army Museum",
    "client": {
      "name": "Unisys Switzerland",
      "link": "http://www.unisys.ch/index.htm"
    },
    "period": "2011",
    "description": "Technologies: C#, .NET, MS SQL Server, Entity Framework, Ext.NET, ASP.NET, WPF "
  },
  {
    "title": "Swiss Environmental Monitoring Platform",
    "client": {
      "name": "Unisys Switzerland",
      "link": "http://www.unisys.ch/index.htm"
    },
    "period": "2009-2010",
    "description": "Development of a distributed multi-tiered platform for automatic acquisition, conversion and monitoring of environmental data of Switzerland. The platform is based on Java/Spring/JPA/Hibernate running on WebLogic Application Server and Oracle Database. "
  },
  {
    "title": "Drive and Walk Navigation Solutions",
    "client": {
      "name": "Nokia Gate 5 GmbH ",
      "link": "http://europe.nokia.com/explore-services/maps"
    },
    "period": "2008-2009",
    "description": "Development of mobile and web applications for Ovi Maps with a strong focus on drive and walk navigation. Implementation of Rich Internet Applications (RIA) using Web 2.0 technologies (AJAX/JavaScript/XHTML)."
  },
  {
    "title": "Platform for Mobile Location-based Advertising",
    "client": {
      "name": "Tieto International",
      "link": "http://www.tieto.com/"
    },
    "period": "2008-2009",
    "description": "Design and implementation of a platform for mobile location-based advertisement services, which enables the delivery of location-relevant advertisements in real time. The platform is a SOA-based enterprise application using Java EE 5 (JPA, JTA, EJB 3, JSF, JMS) and various Open Source Software (CentOS Linux, PosgreSQL/Postgis, GlassFish, Hibernate, Geoserver, OpenLayers). The project was also part of my Master Thesis (final grade: A)."
  }
]
